Барбершоп/Documents/ПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступлениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БезналичнаяОплата</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступленияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БансковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Барбершоп/Enums/ОплатаДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОплатаДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Барбершоп/Enums/ТипДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Барбершоп/Enums/ВидыОперацийПоступленияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступленияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Барбершоп/Enums/ТипКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Барбершоп/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОказанияУслуг</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОплатаДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Барбершоп/Documents/ПоступлениеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Основание")
    И ЗначениеЗаполнено(Параметры.Основание)
    И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда 
    СтруктураОплаты = Документы.РеализацияТоваровИУслуг.ПроверитьОплатуДокумента(Параметры.Основание);
    ПризнакОплаты = СтруктураОплаты.ПризнакОплаты;

    Если ПризнакОплаты = Перечисления.ОплатаДокумента.ПолностьюОплачен Тогда
        СообщениеПользователю = Новый СообщениеПользователю(); 
        СообщениеПользователю.Текст = "Данный документ уже полностью оплачен. Ввод дополнительного документа оплаты не требуется!";
        СообщениеПользователю.Сообщить();
        Отказ = Истина;
        возврат;
    Иначе
        Объект.СуммаДокумента = СтруктураОплаты.ОсталосьОплатить;
		ОсталосьОплатить = СтруктураОплаты.ОсталосьОплатить;
	КонецЕсли;
КонецЕсли;
		
	ЗаполнитРеквизитыФормы();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитРеквизитыФормы()
	Плательщик = Объект.Плательщик;
	ВидОперации = Объект.ВидОперации;
	ТипДенежныхСредств = Объект.ТипДенежныхСредств;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипДенежныхСредств = Перечисления.ТипДенежныхСредств.Наличные;
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупатель;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	СтрокаТипПлательщика = "";    
    Если Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные") Тогда
        Элементы.Касса.Видимость = Истина;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;        
    ИначеЕсли Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Безналичные") Тогда
        Элементы.Касса.Видимость = Ложь;
        Элементы.ЭквайринговыйТерминал.Видимость = Истина;    
    КонецЕсли;
    
    Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПрочееПоступление") Тогда
        Элементы.ДоговорКонтрагента.Видимость = Ложь;    
        Элементы.Плательщик.Видимость = Ложь;
    ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
        Элементы.ДоговорКонтрагента.Видимость = Ложь;
        Элементы.РасчетныйСчет.Видимость = Ложь;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
        Элементы.Касса.Видимость = Истина;
        ТипДенежныхСредств = "Наличные";
        Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
        Элементы.ТипДенежныхСредств.Доступность = Ложь;
        СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
    ИначеЕсли Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке") Тогда
        Элементы.ДоговорКонтрагента.Видимость = Ложь;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
        Элементы.Касса.Видимость = Истина;
        Элементы.РасчетныйСчет.Видимость = Истина;
        Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
        Элементы.ТипДенежныхСредств.Доступность = Ложь;
        СтрокаТипПлательщика = "СправочникСсылка.Банки";
    ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика") Тогда
        Элементы.ДоговорКонтрагента.Видимость = Истина;
        Элементы.Касса.Видимость = Истина;
        Элементы.РасчетныйСчет.Видимость = Ложь;
        Элементы.ЭквайринговыйТерминал.Видимость = Ложь;
        Объект.ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные");
        Элементы.ТипДенежныхСредств.Доступность = Ложь;
        СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
    Иначе
        Элементы.ДоговорКонтрагента.Видимость = Истина;         
        Элементы.Плательщик.Видимость = Истина;
        Элементы.ТипДенежныхСредств.Доступность = Истина;
        Элементы.РасчетныйСчет.Видимость = Ложь;
        СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
    КонецЕсли;
    
    Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда         
        Массив = Новый Массив();
        Массив.Добавить(Тип(СтрокаТипПлательщика));
        
        ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);;
        Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;        
    КонецЕсли;  
    Если Элементы.ДоговорКонтрагента.Видимость = Истина
        И ЗначениеЗаполнено(Объект.Плательщик) Тогда
        Элементы.ДоговорКонтрагента.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	Запрос.Текст = "ВЫБРАТЬ
	|    Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|    Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|    Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|    Контрагенты.Ссылка = &Плательщик";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
		И Выборка.ТипКонтрагента = Перечисления.ТипКонтрагента.Клиент Тогда
		возврат Ложь;
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура ТипДенежныхСредствПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	
	Если Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Наличные")
		И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда // 1
		МассивОчищаемыхРеквизитов.Добавить("ЭквайринговыйТерминал");
		ТекстВопроса = "При изменении реквизита ""Тип денежных средств"" будут очищены следующие данные:
		| - Эквайринговый терминал
		| Продолжить?";
		
	ИначеЕсли Объект.ТипДенежныхСредств =  ПредопределенноеЗначение("Перечисление.ТипДенежныхСредств.Безналичные")
		И ЗначениеЗаполнено(Объект.Касса) Тогда //2
		МассивОчищаемыхРеквизитов.Добавить("Касса");
		ТекстВопроса = "При изменении реквизита ""Тип денежных средств"" будут очищены следующие данные:
		| - Касса
		| Продолжить?";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда //3
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств", ЭтаФорма, МассивОчищаемыхРеквизитов); //4
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!"); //5
	Иначе
		ТипДенежныхСредств =  Объект.ТипДенежныхСредств;
		УстановитьВидимость(); //5
	КонецЕсли;
 
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииТипаДенежныхСредств(Результат, 
ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        Объект[Реквизит] = Неопределено;
    КонецЦикла;
    УстановитьВидимость();
    ТипДенежныхСредств =  Объект.ТипДенежныхСредств;
Иначе
    Объект.ТипДенежныхСредств = ТипДенежныхСредств;
КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	
	МассивОчищаемыхРеквизитов = Новый Массив;
Если Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПрочееПоступление")
    И (ЗначениеЗаполнено(Объект.Плательщик) ИЛИ ЗначениеЗаполнено(Объект.ДоговорКонтрагента)) Тогда
    МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");
    МассивОчищаемыхРеквизитов.Добавить("Плательщик");

    ТекстВопроса = "При изменении реквизита ""ВидОперации"" будут очищены следующие данные:
    | - Договор
    | - Плательщик
    | Продолжить?";

ИначеЕсли (Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника")
    ИЛИ Объект.ВидОперации =  ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ПолучениеНаличныхВБанке"))
    И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
    МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");

    ТекстВопроса = "При изменении реквизита ""Вид операции"" будут очищены следующие данные:
    | - Договор
    | Продолжить?";

КонецЕсли;

Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииВидаОперации", ЭтаФорма, МассивОчищаемыхРеквизитов);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
Иначе
    ВидОперации =  Объект.ВидОперации;
    УстановитьВидимость();
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииВидаОперации(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        Объект[Реквизит] = Неопределено;
    КонецЦикла;
    УстановитьВидимость();
    ВидОперации =  Объект.ВидОперации;
Иначе
    Объект.ВидОперации = ВидОперации;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
ЭтоПоставщик = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
МассивОчищаемыхРеквизитов = Новый Массив;

Если НЕ ЭтоПоставщик И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
    МассивОчищаемыхРеквизитов.Добавить("ДоговорКонтрагента");

    ТекстВопроса = "При изменении реквизита ""Плательщик"" будут очищены следующие данные:
    | - Договор
    | Продолжить?";
КонецЕсли;

Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииПлательщик", ЭтаФорма, МассивОчищаемыхРеквизитов);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
Иначе
    Плательщик =  Объект.Плательщик;
    УстановитьВидимость();
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПлательщик(Результат, ДополнительныеПараметры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
        Объект[Реквизит] = Неопределено;
    КонецЦикла;
    УстановитьВидимость();
    Плательщик =  Объект.Плательщик;
Иначе
    Объект.Плательщик = Плательщик;
КонецЕсли;
КонецПроцедуры 		

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	Если ОсталосьОплатить > 0 И Объект.СуммаДокумента > ОсталосьОплатить Тогда
		Объект.СуммаДокумента = ОсталосьОплатить;
	КонецЕсли;
	
КонецПроцедуры
